{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Esse arquivo serve para adicionar mais dados na ontologia\n",
    "# Autor: Deivis Felipe Guerreiro Fagundes\n",
    "# Data: 21/05/2023"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Faz o import das bibliotecas\n",
    "# Selenium é uma biblioteca para fazer o scraping de dados\n",
    "# Pandas é uma biblioteca para manipular os dados\n",
    "# Time é uma biblioteca para fazer o programa esperar um tempo\n",
    "# BeautifulSoup é uma biblioteca para fazer o scraping de dados\n",
    "# OWLReady2 é uma biblioteca para criar ontologias em OWL\n",
    "import pandas as pd\n",
    "import time\n",
    "import os\n",
    "# biblioteca para criar ontologias usando rdflib\n",
    "from rdflib import Graph, Literal, RDF, URIRef, Namespace, OWL, RDFS\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Inizializa a ontologia\n",
    "\n",
    "# Verifica se o arquivo da ontologia existe, se existir abre ele\n",
    "if os.path.isfile(\"ontologia.owl\"):\n",
    "    # abre o arquivo da ontologia\n",
    "    onto = Graph().parse(\"ontologia.owl\")\n",
    "\n",
    "onto.namespace_manager.bind(\"OntologiaVirus\", URIRef(\"http://www.semanticweb.org/deivis/ontologies/2021/5/OntologiaVirus#\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nebaa3225bd334b20b6485262a5b42af5 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cria a hierarquia de classes cientificas dos seres vivos\n",
    "# Reino -> Filo -> Classe -> Ordem -> Familia -> Genero -> Especie\n",
    "\n",
    "# Cria a classe Reino\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Reino\"), RDF.type, OWL.Class))\n",
    "\n",
    "# Cria a classe Filo\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Filo\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Reino\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Filo\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Reino\")))\n",
    "\n",
    "# Cria a classe Classe\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Classe\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Filo\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Classe\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Filo\")))\n",
    "\n",
    "# Cria a classe Ordem\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Ordem\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Classe\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Ordem\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Classe\")))\n",
    "\n",
    "# Cria a classe Familia\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Familia\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Ordem\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Familia\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Ordem\")))\n",
    "\n",
    "# Cria a classe Genero\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Genero\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Familia\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Genero\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Familia\")))\n",
    "\n",
    "# Cria a classe Especie\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Especie\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Genero\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Especie\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Genero\")))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nebaa3225bd334b20b6485262a5b42af5 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Insere instancias na ontologia de seres vivos\n",
    "\n",
    "# Cria uma instancia de Reino\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Animalia\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Reino\")))\n",
    "\n",
    "# Cria uma instancia de Filo\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Chordata\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Filo\")))\n",
    "\n",
    "# Cria uma instancia de Classe\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Mammalia\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Classe\")))\n",
    "\n",
    "# Cria uma instancia de Ordem\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Carnivora\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Ordem\")))\n",
    "\n",
    "# Cria uma instancia de Familia\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Felidae\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Familia\")))\n",
    "\n",
    "# Cria uma instancia de Genero\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Panthera\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Genero\")))\n",
    "\n",
    "# Cria uma instancia de Especie\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraLeo\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Especie\")))\n",
    "\n",
    "# Cria uma instancia de Especie\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraTigris\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Especie\")))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nebaa3225bd334b20b6485262a5b42af5 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cria a hierarqui de vacinas\n",
    "\n",
    "# Cria a classe Vacina\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Vacina\"), RDF.type, OWL.Class))\n",
    "\n",
    "# Cria a classe VacinaViral\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViral\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Vacina\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViral\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Vacina\")))\n",
    "\n",
    "# Cria a classe VacinaBacteriana\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaBacteriana\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de Vacina\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaBacteriana\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Vacina\")))\n",
    "\n",
    "# Cria a classe VacinaViralAtenuada\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralAtenuada\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de VacinaViral\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralAtenuada\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViral\")))\n",
    "\n",
    "# Cria a classe VacinaViralInativada\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralInativada\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de VacinaViral\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralInativada\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViral\")))\n",
    "\n",
    "# Cria a classe VacinaViralSubunitaria\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralSubunitaria\"), RDF.type, OWL.Class))\n",
    "# Bota como subclasse de VacinaViral\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralSubunitaria\"), RDFS.subClassOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViral\")))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nebaa3225bd334b20b6485262a5b42af5 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Criação de propriedades\n",
    "\n",
    "# Cria as propriedades temVirus e virusDe que são inversas, tendo Host como dominio e Virus como range\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVirus\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVirus\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVirus\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVirus\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVirus\")))\n",
    "# Cria as propriedades temVacina e vacinaDe que são inversas, tendo Virus como dominio e Vacina como range\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVacina\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVacina\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVacina\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Vacina\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVacina\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Vacina\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVacina\")))\n",
    "# Cria as propriedades temEspecie e especieDe que são inversas, tendo Host como dominio e Especie como range\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temEspecie\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temEspecie\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temEspecie\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Especie\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temEspecie\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#especieDe\")))\n",
    "# Ela seja uma propriedade funcional, ou seja, cada instancia de Host só pode ter uma instancia de Especie\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temEspecie\"), RDF.type, OWL.FunctionalProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#especieDe\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#especieDe\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Especie\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#especieDe\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#especieDe\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temEspecie\")))\n",
    "\n",
    "# Propriedade: \"temContatoDiretoCom\" transitiva\n",
    "# Domínio: cellular_organisms\n",
    "# range: cellular_organisms\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temContatoDiretoCom\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temContatoDiretoCom\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temContatoDiretoCom\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temContatoDiretoCom\"), RDF.type, OWL.TransitiveProperty))\n",
    "\n",
    "# Transforma virusDe em some values from\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\"), OWL.someValuesFrom, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "# Transforma vacinaDe em some values from\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\"), OWL.someValuesFrom, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "\n",
    "# Propriedade: \"pertenceAoReino\" usando all values from\n",
    "# Domínio: cellular_organisms\n",
    "# Range: Reino\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoReino\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoReino\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoReino\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Reino\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoReino\"), OWL.allValuesFrom, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Animalia\")))\n",
    "# Propriedade: \"pertenceAoFilo\" usando all values from\n",
    "# Domínio: cellular_organisms\n",
    "# Range: Filo\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoFilo\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoFilo\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoFilo\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Filo\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoFilo\"), OWL.allValuesFrom, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Chordata\")))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nc39c2411b67842228926f9b401635f18 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Faz uma copia de backup da ontologia\n",
    "onto.serialize(\"ontologia backup.owl\", format = \"xml\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 177,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Recarrega a ontologia do backup\n",
    "onto = Graph().parse(\"ontologia backup.owl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 178,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Integração com o http://xmlns.com/foaf/0.1/\n",
    "# Faz a importação de 5 classes do FOAF\n",
    "\n",
    "# Importa a classe Person\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/Person\"), RDF.type, RDFS.Class))\n",
    "# Importa a classe Organization\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/Organization\"), RDF.type, RDFS.Class))\n",
    "# Importa a classe Group\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/Group\"), RDF.type, RDFS.Class))\n",
    "# Importa a classe Agent\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/Agent\"), RDF.type, RDFS.Class))\n",
    "# Importa a classe Document\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/Document\"), RDF.type, RDFS.Class))\n",
    "\n",
    "# Faz a importação de propriedades do FOAF\n",
    "\n",
    "# Pega as propriedades do FOAF e adiciona como propriedades da ontologia\n",
    "\n",
    "# Importa a propriedade name\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/name\"), RDF.type, RDF.Property))\n",
    "# Importa a propriedade title\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/title\"), RDF.type, RDF.Property))\n",
    "# Importa a propriedade familyName\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/familyName\"), RDF.type, RDF.Property))\n",
    "# Importa a propriedade givenName\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/givenName\"), RDF.type, RDF.Property))\n",
    "# Importa a propriedade nick\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/nick\"), RDF.type, RDF.Property))\n",
    "\n",
    "# Relaciona as propriedades do FOAF com as classes da ontologia\n",
    "\n",
    "# Relaciona a propriedade name com a classe Person\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/name\"), RDFS.domain, URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/name\"), RDFS.range, RDFS.Literal))\n",
    "# Relaciona a propriedade title com a classe Person\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/title\"), RDFS.domain, URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/title\"), RDFS.range, RDFS.Literal))\n",
    "# Relaciona a propriedade familyName com a classe Person\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/familyName\"), RDFS.domain, URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/familyName\"), RDFS.range, RDFS.Literal))\n",
    "# Relaciona a propriedade givenName com a classe Person\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/givenName\"), RDFS.domain, URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/givenName\"), RDFS.range, RDFS.Literal))\n",
    "# Relaciona a propriedade nick com a classe Person\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/nick\"), RDFS.domain, URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/nick\"), RDFS.range, RDFS.Literal))\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "# Restaura o namespace para a ontologia de virus\n",
    "onto.namespace_manager.bind(\"OntologiaVirus\", URIRef(\"http://www.semanticweb.org/deivis/ontologies/2021/5/OntologiaVirus#\"))\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 179,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N27507930809143259c430d58986854da (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 179,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Criação das classes de sintomas\n",
    "\n",
    "# Cria a classe Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\"), RDF.type, OWL.Class))\n",
    "\n",
    "# Cria as propriedades de dados dos sintomas\n",
    "\n",
    "# Cria a propriedade de dados nomeSintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#nomeSintoma\"), RDF.type, RDF.Property))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#nomeSintoma\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#nomeSintoma\"), RDFS.range, RDFS.Literal))\n",
    "\n",
    "# Cria a propriedade de dados descricaoSintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#descricaoSintoma\"), RDF.type, RDF.Property))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#descricaoSintoma\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#descricaoSintoma\"), RDFS.range, RDFS.Literal))\n",
    "\n",
    "# Cria as propriedades de objetos dos sintomas\n",
    "\n",
    "# Cria a propriedade de objeto sintomaDe\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#sintomaDe\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#sintomaDe\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#sintomaDe\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#sintomaDe\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temSintoma\")))\n",
    "# Cria a propriedade de objeto temSintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temSintoma\"), RDF.type, OWL.ObjectProperty))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temSintoma\"), RDFS.domain, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temSintoma\"), RDFS.range, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temSintoma\"), OWL.inverseOf, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#sintomaDe\")))\n",
    "\n",
    "# Cria as instancias de sintomas\n",
    "\n",
    "# Cria a instancia de Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Febre\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "# Cria a instancia de Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tosse\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "# Cria a instancia de Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DorDeCabeca\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "# Cria a instancia de Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DorNoCorpo\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "# Cria a instancia de Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DorDeGarganta\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "# Cria a instancia de Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DificuldadeDeRespirar\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "# Cria a instancia de Sintoma\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PerdaDePaladar\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Sintoma\")))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 180,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N27507930809143259c430d58986854da (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 180,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cadrastro de Hosts e relaciona com especies de baixo, que já estão na ontologia\n",
    "# PantheraLeo\n",
    "# PantheraTigris\n",
    "\n",
    "# Cria a instancia Leao da classe Host e relaciona com a instancia PantheraLeo (especieDe)\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#especieDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraLeo\")))\n",
    "# Cria a instancia Tigre da classe Host e relaciona com a instancia PantheraTigris (especieDe)\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Host\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#especieDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraTigris\")))\n",
    "\n",
    "# Cria a instancia do virus Rabies virus e fala que ela pertence ao reino Animalia\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoReino\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Animalia\")))\n",
    "# Cria a instancia do virus SARS-CoV-2 e fala que ela pertence ao reino Animalia\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#SARS-CoV-2\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Viruses\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#SARS-CoV-2\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#pertenceAoReino\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Animalia\")))\n",
    "\n",
    "# Cria a vacina Vacina antirrábica e fala que ela é uma instancia de VacinaViralAtenuada\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralAtenuada\")))\n",
    "# Relaciona com a especie PantheraLeo\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraLeo\")))\n",
    "# Adiciona o temVacina\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraLeo\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVacina\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\")))\n",
    "\n",
    "# Faz as relações entre RabiesVirus e Febre\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temSintoma\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Febre\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Febre\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#sintomaDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\")))\n",
    "# Faz as relações entre RabiesVirus e Tosse\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temSintoma\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tosse\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tosse\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#sintomaDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\")))\n",
    "\n",
    "# Faz o contato direto entre Leao e Tigre\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temContatoDiretoCom\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temContatoDiretoCom\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao\")))\n",
    "\n",
    "# Relaciona o RabiesVirus com o Leao, virus virusDe host e host temVirus virus\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVirus\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\")))\n",
    "# Relaciona o RabiesVirus com o Tigre, virus virusDe host e host temVirus virus\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#virusDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre\")))\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#temVirus\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus\")))\n",
    "\n",
    "# Cria uma relação de vacina com :foaf:Group criadaPeloGrupo\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), URIRef(\"http://xmlns.com/foaf/0.1/criadaPeloGrupo\"), URIRef(\"http://xmlns.com/foaf/0.1/Group\")))\n",
    "\n",
    "# Cria o Grupo Instituto Pasteur\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/InstitutoPasteur\"), RDF.type, URIRef(\"http://xmlns.com/foaf/0.1/Group\")))\n",
    "\n",
    "# Relaciona a vacina antirrábica com o Instituto Pasteur\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), URIRef(\"http://xmlns.com/foaf/0.1/criadaPeloGrupo\"), URIRef(\"http://xmlns.com/foaf/0.1/InstitutoPasteur\")))\n",
    "\n",
    "# Cria a Person Louis Pasteur\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/LouisPasteur\"), RDF.type, URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "\n",
    "# Cria a relação criadaPor entre vacina e Person\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Vacina\"), URIRef(\"http://xmlns.com/foaf/0.1/criadaPor\"), URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "\n",
    "# Cria a relação de vacina com :foaf:Person criadaPor\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), URIRef(\"http://xmlns.com/foaf/0.1/criadaPor\"), URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "# Relaciona a vacina antirrábica com Louis Pasteur\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), URIRef(\"http://xmlns.com/foaf/0.1/criadaPor\"), URIRef(\"http://xmlns.com/foaf/0.1/LouisPasteur\")))\n",
    "\n",
    "# Cria a organização Pfizer-BioNTech\n",
    "onto.add((URIRef(\"http://xmlns.com/foaf/0.1/Pfizer-BioNTech\"), RDF.type, URIRef(\"http://xmlns.com/foaf/0.1/Organization\")))\n",
    "\n",
    "# Cria a relação de vacina com :foaf:Organization criadaPelaOrganizacao\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), URIRef(\"http://xmlns.com/foaf/0.1/criadaPelaOrganizacao\"), URIRef(\"http://xmlns.com/foaf/0.1/Organization\")))\n",
    "# Relaciona a vacina antirrábica com a Pfizer-BioNTech\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica\"), URIRef(\"http://xmlns.com/foaf/0.1/criadaPelaOrganizacao\"), URIRef(\"http://xmlns.com/foaf/0.1/Pfizer-BioNTech\")))\n",
    "\n",
    "# Cria a Person Jonas Salk\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#JonasSalk\"), RDF.type, URIRef(\"http://xmlns.com/foaf/0.1/Person\")))\n",
    "# Adiciona o nome Jonas Salk\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#JonasSalk\"), URIRef(\"http://xmlns.com/foaf/0.1/name\"), Literal(\"Jonas Salk\")))\n",
    "# Cria a instancia da vacina Vacina contra a poliomielite\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaContraAPoliomielite\"), RDF.type, URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaViralInativada\")))\n",
    "# Relaciona com a instancia da Person Jonas Salk\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaContraAPoliomielite\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#criadaPor\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#JonasSalk\")))\n",
    "# Relaciona com a instancia da especie PantheraLeo\n",
    "onto.add((URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaContraAPoliomielite\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#vacinaDe\"), URIRef(\"http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraLeo\")))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N2c07585ef5a2488dbe3a9d8733252336 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 100,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Salvando a ontologia\n",
    "onto.serialize(\"ontologia.owl\", format=\"xml\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraTigris'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraLeo'),)\n",
      "----------Consulta 1----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#SARS-CoV-2'),)\n",
      "----------Consulta 2----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica'),)\n",
      "----------Consulta 3----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Febre'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tosse'),)\n",
      "----------Consulta 4----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre'),)\n",
      "----------Consulta 5----------\n"
     ]
    }
   ],
   "source": [
    "# 1-5 consultas SPARQL Query, usando a biblioteca rdflib\n",
    "\n",
    "# 1 - Listar todas as espécies presentes na ontologia:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?especie\n",
    "WHERE {\n",
    "  ?host a :Host .\n",
    "  ?host :especieDe ?especie .\n",
    "  ?especie a :Especie .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 1----------\")\n",
    "\n",
    "# 2 - Listar todos os vírus que pertencem ao reino \"Animal\":\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?virus\n",
    "WHERE {\n",
    "  ?virus a :Viruses .\n",
    "  ?virus :pertenceAoReino :Animalia .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 2----------\")\n",
    "\n",
    "# 3 - Encontrar todas as vacinas disponíveis para uma determinada espécie:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?vacina\n",
    "WHERE {\n",
    "  ?vacina :vacinaDe ?especie .\n",
    "  ?especie :temVacina ?vacina .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 3----------\")\n",
    "\n",
    "# 4 - Encontrar os sintomas causados por um determinado vírus:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?sintoma\n",
    "WHERE {\n",
    "  ?sintoma :sintomaDe ?virus .\n",
    "  ?virus :temSintoma ?sintoma .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 4----------\")\n",
    "\n",
    "# 5 - Listar todos os hosts que tem contato direto com um determinado host:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?host\n",
    "WHERE {\n",
    "  ?host :temContatoDiretoCom ?host2 .\n",
    "  ?host2 :temContatoDiretoCom ?host .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 5----------\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 145,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus'),)\n",
      "----------Consulta 6----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica'),)\n",
      "----------Consulta 7----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PantheraLeo'),)\n",
      "----------Consulta 8----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Rhizidiovirus'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DNA_viruses'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#SARS-CoV-2'),)\n",
      "----------Consulta 9----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Rhizidiovirus'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DNA_viruses'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#SARS-CoV-2'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#unidentified_rumen_bacterium_RFN45'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#bacterium_enrichment_culture_clone_IcB1'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#bacterium_enrichment_culture_clone_ALO1_GLFRUDD03F4KLC'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#uncultured_bacterium_BD_contig02109'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#uncultured_bacterium_Contig22807'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#bacterium_enrichment_culture_clone_ALO1_GLFRUDD03GHITS'),)\n",
      "----------Consulta 10----------\n"
     ]
    }
   ],
   "source": [
    "# 6 - 10 consultas SPARQL Query, usando a biblioteca rdflib\n",
    "\n",
    "# 6 - Listar todos os vírus que têm uma determinada espécie:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?virus\n",
    "WHERE {\n",
    "    ?virus :virusDe ?host .\n",
    "    ?host :especieDe ?especie .\n",
    "    ?especie a :Especie .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 6----------\")\n",
    "\n",
    "# 7 - Listar todas as VacinaViralAtenuada disponíveis na ontologia\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?vacina\n",
    "WHERE {\n",
    "    ?vacina a :VacinaViralAtenuada .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 7----------\")\n",
    "\n",
    "# 8 - Listar todos os hosts que têm uma determinada vacina\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?host\n",
    "WHERE {\n",
    "    ?host :temVacina ?vacina .\n",
    "    ?vacina a :VacinaViralAtenuada .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 8----------\")\n",
    "\n",
    "# 9 - Listar todos os virus da ontologia, limitar a 10 resultados\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?virus\n",
    "WHERE {\n",
    "    ?virus a :Viruses .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 9----------\")\n",
    "\n",
    "# 10 - Lista todas as instancias de virus que são de uma classe que tem como superclasse a classe Viruses\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?virus\n",
    "WHERE {\n",
    "    ?virus a/rdfs:subClassOf* :Viruses .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 10----------\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 158,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#unidentified_rumen_bacterium_RFN45'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#bacterium_enrichment_culture_clone_IcB1'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#bacterium_enrichment_culture_clone_ALO1_GLFRUDD03F4KLC'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#uncultured_bacterium_BD_contig02109'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#uncultured_bacterium_Contig22807'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#bacterium_enrichment_culture_clone_ALO1_GLFRUDD03GHITS'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#uncultured_bacterium_BD_contig03248'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#bacterium_enrichment_culture_clone_ALO1_GLFRUDD03FKWD6'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#archaeon_enrichment_culture_clone_A21D11'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#uncultured_bacterium_N271E'),)\n",
      "----------Consulta 11----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Leao'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tigre'),)\n",
      "----------Consulta 12----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Febre'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DorDeGarganta'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DorDeCabeca'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#PerdaDePaladar'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DorNoCorpo'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#DificuldadeDeRespirar'),)\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Tosse'),)\n",
      "----------Consulta 13----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica'),)\n",
      "----------Consulta 14----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica'),)\n",
      "----------Consulta 15----------\n"
     ]
    }
   ],
   "source": [
    "# 11 - 15 consultas SPARQL Query, usando a biblioteca rdflib\n",
    "\n",
    "# 11 - Listar todas as instancias de cellula_organisms que são de uma classe que tem como superclasse a classe cellular_organisms\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?cellula_organisms\n",
    "WHERE {\n",
    "    ?cellula_organisms a/rdfs:subClassOf* :cellular_organisms .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 11----------\")\n",
    "\n",
    "# 12 - Listar todos os hosts da ontologia, limitar a 10 resultados\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?host\n",
    "WHERE {\n",
    "    ?host a :Host .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 12----------\")\n",
    "\n",
    "# 13 - Listar todas as instancias de Sintoma que são de uma classe que tem como superclasse a classe Sintoma\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?sintoma\n",
    "WHERE {\n",
    "    ?sintoma a/rdfs:subClassOf* :Sintoma .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 13----------\")\n",
    "\n",
    "# 14 - Listar todas as vacinas que foram desenvolvidas por um determinado grupo:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "SELECT DISTINCT ?vacina\n",
    "WHERE {\n",
    "    ?vacina foaf:criadaPeloGrupo ?grupo .\n",
    "    ?grupo a foaf:Group .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 14----------\")\n",
    "\n",
    "# 15 - Encontrar todas as vacinas que foram desenvolvidas por uma determinada pessoa:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "SELECT DISTINCT ?vacina\n",
    "WHERE {\n",
    "    ?vacina foaf:criadaPor ?pessoa .\n",
    "    ?pessoa a foaf:Person .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 15----------\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaAntirrabica'),)\n",
      "----------Consulta 16----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaContraAPoliomielite'),)\n",
      "----------Consulta 17----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaContraAPoliomielite'),)\n",
      "----------Consulta 18----------\n",
      "(rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'),)\n",
      "(rdflib.term.URIRef('http://xmlns.com/foaf/0.1/name'),)\n",
      "----------Consulta 19----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#Salmonella_phage_PSP222'),)\n",
      "----------Consulta 20----------\n"
     ]
    }
   ],
   "source": [
    "# 16 - 20 consultas SPARQL Query, usando a biblioteca rdflib\n",
    "\n",
    "# 16 - Listar todas as vacinas que foram desenvolvidas por uma determinada organização ou grupo:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "SELECT DISTINCT ?vacina\n",
    "WHERE {\n",
    "    {\n",
    "        ?vacina foaf:criadaPelaOrganizacao ?organizacao .\n",
    "        ?organizacao a foaf:Organization .\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        ?vacina foaf:criadaPeloGrupo ?grupo .\n",
    "        ?grupo a foaf:Group .\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 16----------\")\n",
    "\n",
    "# 17 - Lista todas as vacinas que foram desenvolvidas por uma determinada pessoa e não foram desenvolvidas por uma determinada organização ou grupo:\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "SELECT DISTINCT ?vacina\n",
    "WHERE {\n",
    "    {\n",
    "        ?vacina :criadaPor ?pessoa .\n",
    "        ?pessoa a foaf:Person .\n",
    "    }\n",
    "    MINUS\n",
    "    {\n",
    "        ?vacina foaf:criadaPelaOrganizacao ?organizacao .\n",
    "        ?organizacao a foaf:Organization .\n",
    "    }\n",
    "    MINUS\n",
    "    {\n",
    "        ?vacina foaf:criadaPeloGrupo ?grupo .\n",
    "        ?grupo a foaf:Group .\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 17----------\")\n",
    "\n",
    "# 18 - Listas todas as vacinas do Jonas Salk\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "SELECT DISTINCT ?vacina\n",
    "WHERE {\n",
    "    ?vacina :criadaPor ?pessoa .\n",
    "    ?pessoa a foaf:Person .\n",
    "    ?pessoa foaf:name \"Jonas Salk\" .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 18----------\")\n",
    "\n",
    "# 19 - Monstra todas as propriedades do Jonas Salk\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "SELECT DISTINCT ?propriedade\n",
    "WHERE {\n",
    "    ?vacina :criadaPor ?pessoa .\n",
    "    ?pessoa a foaf:Person .\n",
    "    ?pessoa foaf:name \"Jonas Salk\" .\n",
    "    ?pessoa ?propriedade ?valor .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 19----------\")\n",
    "\n",
    "\n",
    "# 20 - Lista todas os virus que são instancias da classe Caudoviricetes\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?virus\n",
    "WHERE {\n",
    "    ?virus a :Caudoviricetes .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 20----------\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus'),)\n",
      "----------Consulta 21----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#RabiesVirus'),)\n",
      "----------Consulta 22----------\n",
      "(rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#VacinaContraAPoliomielite'), rdflib.term.URIRef('http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#JonasSalk'))\n",
      "----------Consulta 23----------\n"
     ]
    }
   ],
   "source": [
    "# 21 - 25 consultas SPARQL Query, usando a biblioteca rdflib\n",
    "\n",
    "# 21 - Lista todas os virus que tenha o sintoma Tosse\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT DISTINCT ?virus\n",
    "WHERE {\n",
    "    ?virus :temSintoma :Tosse .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 21----------\")\n",
    "\n",
    "# 22 - Lista todas os virus que tenha o sintoma Febre e Tosse\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT ?virus\n",
    "WHERE {\n",
    "    ?virus :temSintoma :Febre .\n",
    "    ?virus :temSintoma :Tosse .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 22----------\")\n",
    "\n",
    "# 23 - Traz a vacina e o seu criador\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "SELECT ?vacina ?criador\n",
    "WHERE {\n",
    "    ?vacina :criadaPor ?criador .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 23----------\")\n",
    "\n",
    "# 25 - Trazer todos os hosts que tem contato direto com o Leao ou Tigre\n",
    "\n",
    "query = \"\"\"\n",
    "PREFIX : <http://www.semanticweb.org/deivis/ontologies/2023/5/OntologiaVirus#>\n",
    "SELECT ?host\n",
    "WHERE {\n",
    "    {\n",
    "        ?host :temContatoDiretoCom :Leao .\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        ?host :temContatoDiretoCom :Tigre .\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "for row in onto.query(query):\n",
    "    print(row)\n",
    "\n",
    "print(\"----------Consulta 25----------\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
